In [1]:
import pandas as pd 
import seaborn as sns 
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('population_projection.csv')

In [3]:
df.head()

   year    month        state  gender  value                unit  note
0  2036  October  West Bengal   Total  43964  value in Thousands   NaN
1  2036  October  West Bengal    Male  22615  value in Thousands   NaN
2  2036  October  West Bengal  Female  21349  value in Thousands   NaN
3  2036  October  Uttarakhand   Total   5506  value in Thousands   NaN
4  2036  October  Uttarakhand    Male   2922  value in Thousands   NaN

Remove Total

In [5]:
df.isnull().sum()

year         0
month        0
state        0
gender       0
value        0
unit         0
note      8892
dtype: int64

In [6]:
df.shape

(8892, 7)

In [8]:
df.drop(columns='note', inplace=True)

In [9]:
df['unit'].value_counts()

unit
value in Thousands    8892
Name: count, dtype: int64

In [10]:
df.drop(columns='unit', inplace=True)

In [11]:
df.head()

   year    month        state  gender  value
0  2036  October  West Bengal   Total  43964
1  2036  October  West Bengal    Male  22615
2  2036  October  West Bengal  Female  21349
3  2036  October  Uttarakhand   Total   5506
4  2036  October  Uttarakhand    Male   2922

In [12]:
df['gender'].value_counts()

gender
Total     2964
Male      2964
Female    2964
Name: count, dtype: int64

In [13]:
df['year'].value_counts()

year
2036    342
2035    342
2012    342
2013    342
2014    342
2015    342
2016    342
2017    342
2018    342
2019    342
2020    342
2021    342
2022    342
2023    342
2024    342
2025    342
2026    342
2027    342
2028    342
2029    342
2030    342
2031    342
2032    342
2033    342
2034    342
2011    342
Name: count, dtype: int64